### Введение в SQL Sub-Queries

In [26]:
# Создаем Таблицу
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(
                      team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit()

print("Table created successfully");

#conn.close()

Opened database successfully
Table created successfully

In [27]:
conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE IF NOT EXISTS team_players(
                      team text, 
                      country text, 
                      player text, 
                      goals integer);''')

conn.commit()

In [31]:
# Добавляем значения

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")


conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Spain', 'Huan', 10);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Honsales', 10);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Bernd Leno', 5);")
conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Eder Militan', 2018, 4);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Nelsen Semedu', 4);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Rob Holding', 5 );")

conn.commit()

In [33]:
#Представления

cur = conn.execute("SELECT goals, team FROM team_players;")

cur.fetchall()

[(10, 'Real Madrid'),
 (10, 'Barcelona'),
 (10, 'Real Madrid'),
 (10, 'Barcelona'),
 (5, 'Arsenal'),
 (4, 'Real Madrid'),
 (4, 'Barcelona'),
 (10, 'Real Madrid'),
 (10, 'Barcelona'),
 (5, 'Arsenal'),
 (4, 'Real Madrid'),
 (4, 'Barcelona'),
 (10, 'Real Madrid'),
 (10, 'Barcelona'),
 (5, 'Arsenal'),
 (4, 'Real Madrid'),
 (4, 'Barcelona'),
 (5, 'Arsenal')]

In [17]:
#Выборки

cur = conn.execute("SELECT total_goals, team FROM team_data WHERE country != 'UK' OR total_goals> 50 ;")

cur.fetchall()

[(53, 'Real Madrid'),
 (47, 'Barcelona'),
 (52, 'Arsenal'),
 (49, 'Real Madrid'),
 (45, 'Barcelona')]

In [18]:
# Вычисляем среднее

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,country,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 'UK', 51.0)
('Barcelona', 'Spain', 46.0)
('Real Madrid', 'Spain', 51.0)

In [22]:
# Неправильный запрос

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team AS team_name ,
                            AVG(total_goals) AS avg_goals
                          FROM team_data                          
                          GROUP BY team
                          HAVING avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [23]:
# Правильный запрос

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [37]:
#Joins

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_data.team,team_data.country,player,total_goals, goals
                          
                          FROM team_data
                          INNER JOIN team_players on team_data.team = team_players.team;''')

cursor.fetchall()

[('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5)]

In [40]:
conn.close()

# SQL Programming - Основы с magic командами

## 1.2 Подключение к базе

In [42]:
# Загружаем sql extension

%load_ext sql


#
%sql sqlite:////content/test.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @/content/test.db'

## 1.3 Создание таблицы

In [59]:
# Пример 1
#
%%sql 
CREATE TABLE if not exists Classmates (
    PersonID, 
    LastName, 
    FirstName, 
    Phone, 
    Residence
); 

SELECT * From Classmates;

 * sqlite:////content/test.db
Done.
Done.

[]

In [44]:
# Пример  2

%%sql
CREATE TABLE if not exists Customers(
   Id,   
   Name,  
   Age,
   Address,  
   Salary
);

SELECT * From Customers;

 * sqlite:////content/test.db
Done.
Done.

[]

In [45]:
# Пример 3
%%sql
CREATE TABLE if not exists Students(
    AdmissionsNo,
    FirstName,
    MiddleName,
    LastName,
    DateOfBirth,
    DateOfAdmission
);
 
SELECT * from Students;

 * sqlite:////content/test.db
Done.
Done.

[]

### <font color="green"> 1.3 ДЗ </font>

In [ ]:
# Задача 1
# Давайте создадим таблицу с именем PC со следующими полями;
# code, model, speed, RAM, HD, CD и цена.
# Мы также указываем соответствующие типы данных для нашей таблицы, добавляем туда произвольные данные и отображаем ее.
%%sql 
 CREATE TABLE if not exists PC(
  ...
);

insert into ...
SELECT * from PC;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Задача 2
# Давайте создадим таблицу с именем PC со следующими полями;
# code, model, speed, type and Price.
# Мы также указываем соответствующие типы данных для нашей таблицы, добавляем туда произвольные данные и отображаем ее.

%%sql
CREATE TABLE if not exists Printer(
...
);
SELECT * from Printer;

 * sqlite://
Done.
Done.

[]

## 1.4 Устанавливаем типы данных для столбцов

In [46]:
# Пример 1
#integer, text, varchar,date,float
%%sql
CREATE TABLE IF NOT EXISTS Citizens (
    NationalID int,
    FirstName varchar(255),
    MiddleName varchar(255),
    PostalAddress varchar(255),
    Residence varchar(255));
SELECT * from Citizens;

 * sqlite:////content/test.db
Done.
Done.

[]

In [47]:
# Пример 2

%%sql
CREATE TABLE IF NOT EXISTS artists(
    Artist_Id int,
    Artist_Name varchar(60),
    Artist_DOB date,
    Posters_In_Stock boolean);

SELECT * from artists;

 * sqlite:////content/test.db
Done.
Done.

[]

In [48]:
# Пример  3

%%sql
CREATE TABLE IF NOT EXISTS Players (
    id int,
    name text,
    age integer,
    height float);

SELECT * from Players;

 * sqlite:////content/test.db
Done.
Done.

[]

### <font color="green"> 1.4 ДЗ</font>

In [ ]:
# Задача 1
# Давайте создадим таблицу customer с CustID с типом данных Integer, LastName
# с varchar длиной 25 символов, FirstName с varchar длиной 20 символов
#
%%sql
CREATE TABLE IF NOT EXISTS CUSTOMER(
  ....
 );
SELECT * from CUSTOMER;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Задание 3
# Создайте таблицу с названием sales, в которой хранятся идентификатор продажи, идентификатор клиента, имя и адрес.
# используя также соответствующие типы данных
# 
%%sql
CREATE TABLE IF NOT EXISTS SALES(
    SalesID varchar,
    CustomerID int,
    Name text,
    Address varchar
);
SELECT * from SALES;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Задание 4
# Создайте таблицу с именем сотрудники, в которой хранятся номер сотрудника, имя сотрудника,
# отдел и информацию о зарплате с использованием соответствующих типов данных
#
%%sql
CREATE TABLE IF NOT EXISTS EMPLOYEES(
    ....
    
);
SELECT* from EMPLOYEES;

 * sqlite://
Done.
Done.

[]

## 1.5 Устанавливаем Default Values для столбцов

In [49]:
# Пример  2
# 
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'test',
    height REAL);

 * sqlite:////content/test.db
Done.

[]

### <font color="green"> 1.5 ДЗ</font>

In [ ]:
# Задача 1
# Давайте создадим новую таблицу с именем latest_players с полями, похожими на
# уже созданная таблица Players, но укажите значение по умолчанию unknown
#
%%sql
CREATE TABLE IF NOT EXISTS latest_players(
    ...
    );

 * sqlite://
Done.

[]

In [ ]:
# Задача 2
# Давайте создадим новую таблицу с названиями ресторанов с полями
# - имя: varchar
# - описание: text
# - адрес: строка, значение по умолчанию 'Moscow'
# - user_id: integer
# - last_orders_at: date
# При необходимости мы можем провести внешнее исследование типа данных.
#
%%sql
CREATE TABLE IF NOT EXISTS restaurants(
....
);

 * sqlite://
Done.

[]

## 1.6 Изменение SQL таблиц

In [50]:
# Пример 1
%%sql 
ALTER TABLE Classmates ADD Gender;
 
SELECT * FROM Classmates;

 * sqlite:////content/test.db
Done.
Done.

[]

In [54]:
# Пример 2
#
%%sql 
ALTER TABLE Classmates DROP COLUMN Residence;

 * sqlite:////content/test.db
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE Classmates DROP COLUMN Residence;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [55]:
# Пример 3

%%sql  
ALTER TABLE Classmates RENAME TO Schoolmates;

 * sqlite:////content/test.db
Done.

[]

### <font color="green"> 1.6 ДЗ</font>

In [ ]:
# Задача 1
# Добавьте столбец DOB с типом данных DATE в таблицу TeamMembers с помощью;
# Подсказка: тип данных идет после имени столбца
%%sql 

.....

SELECT *FROM TeamMembers;

 * sqlite://
Done.
Done.

[]

In [ ]:
# Давайте проверим наш тип данных
%%sql
PRAGMA table_info(TeamMembers);

In [ ]:
# Задача 2
# Давайте теперь добавим столбец STUDIO с типом данных TEXT в таблицу Artists
#
%%sql
ALTER TABLE ....

 * sqlite://
Done.

[]

In [ ]:
# Задание 3
# Затем мы переименовываем таблицу Artists в Music Artists
#
%%sql
ALTER TABLE Artists RENAME TO MusicArtists;

 * sqlite://
Done.

[]

## 1.7 Удаление SQL Таблиц

### 1.71 Очистка таблицы

In [56]:
# Пример  1

#
%%sql
TRUNCATE TABLE Classmates;

 * sqlite:////content/test.db
(sqlite3.OperationalError) near "TRUNCATE": syntax error
[SQL: TRUNCATE TABLE Classmates;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### 1.72 Удаление таблицы

In [60]:
# Пример 1
%sql DROP TABLE Classmates;

 * sqlite:////content/test.db
Done.

[]

### <font color="green"> 1.7 ДЗ</font>

In [ ]:
# Задача 1
# Давайте удалим таблицу Players из нашей базы данных
#
%%sql 
....

 * sqlite://
Done.

[]

In [ ]:
# Задача 2
# Давайте удалим таблицу Customers из нашей базы данных
#
%%sql
....

 * sqlite://
Done.

[]

In [ ]:
# Задание 3
# И, наконец, очистить и удалить нашу таблицу Artists из нашей базы данных
#
%%sql
....

 * sqlite://
0 rows affected.

[]

## Чтение данных из таблицы с помощью Pandas

In [63]:
import pandas as pd
import sqlite3

con = sqlite3.connect("test.db")

# Load the data into a DataFrame
surveys_df = pd.read_sql_query("SELECT * from team_data", con)

# Select only data for 2002
#surveys2002 = surveys_df[surveys_df.year == 2002]

# Write the new DataFrame to a new SQLite table
#surveys2002.to_sql("surveys2002", con, if_exists="replace")

con.close()

In [64]:
surveys_df.head()

          team country  season  total_goals
0  Real Madrid   Spain    2019           53
1    Barcelona   Spain    2019           47
2      Arsenal      UK    2019           52
3  Real Madrid   Spain    2018           49
4    Barcelona   Spain    2018           45